# RbsElecPanelCurrentPhasecParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecPanelCurrentPhasecParam Property
ParameterTypeId Class See Also
---
"Current Phase C"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecPanelCurrentPhasecParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecPanelCurrentPhasecParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecPanelCurrentPhasecParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace